---
kind: type
id: T:Autodesk.Revit.DB.AngularDimension
source: html/6f3b8d2e-904b-41cb-e57f-34fc8c1a0f4a.htm
---
# Autodesk.Revit.DB.AngularDimension

An object that represents an Angular Dimension within the Revit project.

## Syntax (C#)
```csharp
public class AngularDimension : Dimension
```